# how to make data set by pandas and numpy

In [1]:
import pandas as pd
import numpy as np

df=pd.DataFrame({'A col':(1, 2, 4, 6),'B  col':(1, 4, 73, 8)})
df.head()

   A col  B  col
0      1       1
1      2       4
2      4      73
3      6       8

In [2]:
df=pd.DataFrame({'leafe area':(465, 765, 243, 123),'Final wight':(13.482, 13.354, 13.344, 13.756)})
df.head()

   leafe area  Final wight
0         465       13.482
1         765       13.354
2         243       13.344
3         123       13.756

In [3]:
arr=np.array([(1, 3, 6, 9),(2, 6, 3, 8),(5, 3, 2, 6)])
pd.DataFrame(arr)

   0  1  2  3
0  1  3  6  9
1  2  6  3  8
2  5  3  2  6

In [4]:
arr=np.array([(2,3,4),(5,4,2),(8,6,4)])
pd.DataFrame(arr)

   0  1  2
0  2  3  4
1  5  4  2
2  8  6  4

In [5]:
pd.DataFrame(np.random.rand(8,6), columns=list('ABCDEF'))

          A         B         C         D         E         F
0  0.939130  0.086562  0.126963  0.838382  0.281080  0.094414
1  0.507756  0.885842  0.151716  0.145182  0.986272  0.795299
2  0.634393  0.729734  0.720439  0.114806  0.828238  0.476661
3  0.969307  0.569403  0.224317  0.168903  0.780348  0.194059
4  0.603502  0.653942  0.700929  0.229012  0.540114  0.579120
5  0.712510  0.715034  0.921396  0.549819  0.509357  0.305336
6  0.947107  0.914265  0.539955  0.072770  0.435751  0.972990
7  0.246647  0.807594  0.687636  0.810440  0.828848  0.804253

In [20]:
pd.DataFrame(np.random.rand(4,5), columns=list('ABCDE'))

          A         B         C         D         E
0  0.447988  0.355414  0.902617  0.026967  0.628553
1  0.574581  0.143841  0.064005  0.923156  0.274834
2  0.437280  0.922803  0.903484  0.122826  0.196897
3  0.561841  0.623078  0.179218  0.874943  0.293914

In [6]:
import pandas as pd

In [29]:
import pandas as pd
pd.__version__

'2.2.1'

In [3]:
pd.show_versions

In [6]:
df=pd.DataFrame({'A':(1,2,3,3,4),'B':(6,4,6,8,6)})

In [7]:
df.head

<bound method NDFrame.head of    A  B
0  1  6
1  2  4
2  3  6
3  3  8
4  4  6>

In [30]:
import numpy as np
arr=np.array([[1,2,3,4,5],[23,4,6,7,5],[4,5,6,7,8]])
pd.DataFrame(arr)

    0  1  2  3  4
0   1  2  3  4  5
1  23  4  6  7  5
2   4  5  6  7  8

In [31]:
pd.DataFrame(np.random.rand(6,3))

          0         1         2
0  0.287464  0.050923  0.852010
1  0.646137  0.019156  0.465369
2  0.331250  0.346401  0.777027
3  0.124177  0.542524  0.487775
4  0.455449  0.808436  0.750327
5  0.672801  0.954219  0.815165

In [16]:
pd.DataFrame(np.random.rand(6,3), columns=list('ABC'))

          A         B         C
0  0.935139  0.713509  0.981455
1  0.862912  0.477814  0.048123
2  0.738272  0.173388  0.656985
3  0.333628  0.045373  0.476185
4  0.177342  0.517525  0.526095
5  0.132931  0.291606  0.730820

In [20]:
pd.DataFrame(np.random.rand(3,3), columns=list('AKL'))

          A         K         L
0  0.626689  0.546427  0.609447
1  0.935620  0.667952  0.834918
2  0.363093  0.534510  0.942730

## HPW TO rename colums of df

In [34]:
df=pd.DataFrame(np.random.rand(6,3))
df.columns=list('TOJ')
df

          T         O         J
0  0.645984  0.232865  0.584555
1  0.001455  0.111021  0.086771
2  0.943440  0.139539  0.622471
3  0.216813  0.821925  0.742617
4  0.528718  0.154842  0.883986
5  0.605014  0.671747  0.256964

In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
kashti= sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
phool=sns.load_dataset( 'tips')
    # assert isinstance(phool, Table)
    # assert len(phooel) == 10936

IndentationError: unexpected indent (835109749.py, line 4)

In [2]:
import seaborn as sns
df= sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df.describe

<bound method NDFrame.describe of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [4]:
df.columns
df.to_csv('tips_save.csv')